In [1]:
#!/usr/bin/python

import sqlite3

# connecting with the database(if there is no database exist, It will create one).
db = sqlite3.connect("student_database.db")

In [2]:
# Declare cursor
cursor = db.cursor()

In [ ]:
# Create table
cursor.execute("create table student_data(phone_no INT Primary Key, email_id TEXT, Course_name TEXT, Fee_paid INT)")

In [7]:
# insert records into the table 
cursor.execute("Insert into student_data(phone_no, email_id, Course_name, Fee_paid) values (9805585458, 'amar@gmail.com', 'data science', 55000)")

# save the records permanently.(If you don't commit, next time you will not see the records in the table)
db.commit()

# count the records inserted
print(cursor.rowcount, "Record(s) inserted")

1 Record(s) inserted

### SELECT query - How to fetch records from the table

In [8]:
# insert records into the table 
cursor.execute("Insert into student_data(phone_no, email_id, Course_name, Fee_paid) values (9805585451, 'rahul@gmail.com', 'data science', 55000)")

# save the records permanently.(If you don't commit, next time you will not see the records in the table)
db.commit()

# count the records inserted
print(cursor.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [10]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9889585458, 'marc@gmail.com', 'data science', 55000)
(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)

In [16]:
cursor.execute("insert into student_data values(9889986798, 'littleone@gmail.com','cloud software',58000)")
db.commit()

print(cursor.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [17]:
# multiple records insertion
cursor.execute("insert into student_data values(9889986584, 'theone@gmail.com','cloud architect',60000),(9889747744, 'mlb@gmail.com','data science',60000)")
db.commit()

print(cursor.rowcount, "Record(s) inserted")

2 Record(s) inserted

In [18]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9889585458, 'marc@gmail.com', 'data science', 55000)
(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)

### How to load data from file into table

Note :- keep csv file the same folder where your jupyter notebook is provide folderlink. You cannot open file directly from github

https://github.com/training-ml/Files  - this is the link from where we access the data science materials

In [19]:
with open('DT_Students.csv','r') as file:
    no_record =0
    for row in file:
        cursor.execute("insert into student_data values ( ?, ?, ?, ?)",row.split(","))
        db.commit()
        no_record +=1
print(no_record, "Record(s) Inserted")

20 Record(s) Inserted

In [20]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9889585458, 'marc@gmail.com', 'data science', 55000)
(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

### where clause - select records based on condition

In [23]:
sql = "Select * from student_data WHERE course_name = 'Data Science' or course_name = 'data science'"
result = cursor.execute(sql)
for row in result:
    print(row)

(9889585458, 'marc@gmail.com', 'data science', 55000)
(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [24]:
sql = "Select * from student_data WHERE fee_paid >= 50000 "
result = cursor.execute(sql)
for row in result:
    print(row)

(9889585458, 'marc@gmail.com', 'data science', 55000)
(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)

### DELETE record - how to delete unwanted records.
Usually developer/Data Scientists are not authorized to delete any records from the table. Database Admin does this kind of tasks

In [25]:
sql = "DELETE from student_data WHERE phone_no = 9889585458 "

result = cursor.execute(sql)
db.commit()

In [26]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [29]:
sql = "Select * from student_data"
result = cursor.execute(sql)
for row in result:
    print(row)

(9805585458, 'amar@gmail.com', 'data science', 55000)
(9805585451, 'rahul@gmail.com', 'data science', 55000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889747744, 'mlb@gmail.com', 'data science', 60000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [31]:
sql = "DELETE from student_data WHERE course_name = 'data science' "

result = cursor.execute(sql)
db.commit()

In [32]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

### ORDER BY

In [37]:
# How to change the order of record (Increasing or decreasing)
result= cursor.execute("SELECT * FROM student_data order by fee_paid")
for row in result:
    print(row)

(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)

In [38]:
result= cursor.execute("SELECT * FROM student_data order by fee_paid desc")
for row in result:
    print(row)

(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)

### UPDATE Table- Update the column value

In [39]:
# Single Record update
cursor.execute("UPDATE student_data SET course_name= 'Cloud Architect' where fee_paid = 140000")

In [40]:
result= cursor.execute("SELECT * FROM student_data")
for row in result:
    print(row)

(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Cloud Architect', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [41]:
result= cursor.execute("SELECT * FROM student_data order by fee_paid")
for row in result:
    print(row)

(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776618, 'student18@gmail.com', 'Cloud Architect', 140000)

In [42]:
result= cursor.execute("SELECT * FROM student_data where fee_paid = 140000")
for row in result:
    print(row)

(9988776618, 'student18@gmail.com', 'Cloud Architect', 140000)

In [44]:
#multiple ecords update using 'IN'
cursor.execute("update student_data SET fee_paid = 135000 where phone_no IN(9889986584, 9988776609, 9988776610)")

In [46]:
result= cursor.execute("SELECT * FROM student_data where phone_no IN(9889986584, 9988776609, 9988776610)")
for row in result:
    print(row)

(9889986584, 'theone@gmail.com', 'cloud architect', 135000)
(9988776609, 'student9@gmail.com', 'Data Science', 135000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 135000)

In [5]:
result= cursor.execute("SELECT * FROM student_data order by phone_no desc")
for row in result:
    print(row)

(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9889986798, 'littleone@gmail.com', 'cloud software', 58000)
(9889986584, 'theone@gmail.com', 'cloud architect', 60000)

In [7]:
# update the records using BETWEEN
sql = "Update student_data set course_name = 'Tableau' where phone_no between 9988776605 and 9988776608"
cursor.execute(sql)

# Verify if its updated
result= cursor.execute("SELECT phone_no, course_name FROM student_data where course_name ='Tableau'")
for row in result:
    print(row)

(9988776605, 'Tableau')
(9988776606, 'Tableau')
(9988776607, 'Tableau')
(9988776608, 'Tableau')

### MIN nad MAX Function

In [9]:
result= cursor.execute("SELECT MIN(fee_paid) FROM student_data")
print("Minimum Fee = ", result.fetchone())

Minimum Fee =  (23000,)

In [12]:
result= cursor.execute("SELECT MAX(fee_paid) FROM student_data")
print("Minimum Fee = ", result.fetchone())

Minimum Fee =  (140000,)

### Subquery
In SQL, A query within another query is called subquery. In other word we can say that a Subquery is a query that is embedded in WHERE clause of another SQL query.
Subqueries can be used with SELECT,UPDATE, INSERT,DELETE statements along with expression operator.

In [4]:
import sqlite3
db = sqlite3.connect("student_course_database.db")

In [5]:
cursor = db.cursor()

In [6]:
cursor.execute("create table course1(courseid INT Primary Key, coursename TEXT, duration INT)")

In [ ]:
cursor.execute("create table student1(rollno INT Primary Key, studentname TEXT, age INT, courseid int, foreign key(courseid) references course1(courseid))")

In [10]:
cursor.execute("insert into course1 values (78, 'Data Science', 12),(56, 'python', 4),(101, 'Database', 7)")
print(cursor.rowcount, "recors(s) inserted")

db.commit;

3 recors(s) inserted

In [11]:
cursor.execute("insert into student1 values (1, 'vikas', 30, 78),(2, 'tabrez', 30, 56),(3, 'nupriya', 29, 78),(4, 'bhuwnesh',32,56)")
print(cursor.rowcount, "recors(s) inserted")

db.commit;

4 recors(s) inserted

In [12]:
result= cursor.execute("select * from course1")
for row in result:
    print(row)

(78, 'Data Science', 12)
(56, 'python', 4)
(101, 'Database', 7)

In [13]:
result= cursor.execute("select * from student1")
for row in result:
    print(row)

(1, 'vikas', 30, 78)
(2, 'tabrez', 30, 56)
(3, 'nupriya', 29, 78)
(4, 'bhuwnesh', 32, 56)

In [18]:
result= cursor.execute("select * from student1 where courseid=(select courseid from course1 where coursename = 'Data Science')")
result.fetchall()

[(1, 'vikas', 30, 78), (3, 'nupriya', 29, 78)]

In [19]:
result= cursor.execute("select * from student1 where courseid=(select courseid from course1 where coursename = 'python')")
result.fetchall()

[(2, 'tabrez', 30, 56), (4, 'bhuwnesh', 32, 56)]

In [20]:
result= cursor.execute("select * from student1 where courseid=56")
for row in result:
    print(row)

(2, 'tabrez', 30, 56)
(4, 'bhuwnesh', 32, 56)

In [21]:
result= cursor.execute("select * from student1 where courseid=(select courseid from course1 where coursename = 'python')")
for row in result:
    print(row)

(2, 'tabrez', 30, 56)
(4, 'bhuwnesh', 32, 56)

### JOIN
1- INNER JOIN - Return record that have matching values in both tables

2- LEFT JOIN - Return all record from the left table, and matched record from the right table.

3- RIGHT JOIN - Return all record from the right table, and matched record from the left table. 

4- FULL JOIN - Return all records when there is a match in either left or right table

In [11]:
cursor.execute("create table student3(phone_no INT Primary Key, student name TEXT, enrolled_date TEXT, marks INT)")

In [13]:
with open('Students_details.csv','r') as file:
    no_record =0
    for row in file:
        cursor.execute("insert into student3 values ( ?, ?, ?, ?)",row.split(","))
        db.commit()
        no_record +=1
print(no_record, "Record(s) Inserted")

20 Record(s) Inserted

In [14]:
result= cursor.execute("select * from student3")
for row in result:
    print(row)

(9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 'Mane', '17-05-2022', 52)
(6609998877, 'Vardy', '17-12-2020', 54)
(6609998878, 'Jota', '06-11-2021', 45)
(6609998879, 'Bruyne', '26-11-2020', 49)
(6609998880, 'Zaha', '05-12-2020', 88)
(6609998881, 'Sterling', '29-10-2020', 61)
(9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 'Maddison', '10-03-2020', 44)
(1687799866, 'Bowen', '14-02-2021', 96)
(1687799867, 'Saka', '19-12-2022', 92)
(1687799868, 'Watkins', '30-01-2021', 49)
(1687799869, 'Mount', '16-09-2022', 48)
(1687799870, 'Raphael', '15-05-2021', 50)
(1687799871, 'Mahrez', '30-10-2021', 72)
(9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 'Fernandes', '01-03-2022', 94)

### INNER JOIN

In [16]:
sql = "select student_data.phone_no, student3.enrolled_date, student3.marks from student_data INNER JOIN student3 ON student_data.phone_no = student3.phone_no"
result = cursor.execute(sql)
for row in result:
    print(row)

(9988776604, '03-10-2020', 85)
(9988776605, '21-06-2020', 39)
(9988776606, '08-05-2020', 86)
(9988776607, '11-05-2022', 57)
(9988776608, '17-05-2022', 52)
(9988776614, '31-03-2022', 71)
(9988776615, '10-03-2020', 44)
(9988776622, '19-02-2021', 93)
(9988776623, '01-03-2022', 94)

### LEFT JOIN

In [ ]:
sql = "select student_data.phone_no, student3.enrolled_date, student3.marks from student_data LEFT JOIN student3 ON student_data.phone_no = student3.phone_no"
result = cursor.execute(sql)
for row in result:
    print(row)

#### RIGHT JOIN and FULL OUTER JOIN not suppoted in Sqlite3

### PYTHON and SQL (How to deal with python code

In [3]:
while True:
    
    try:
        ph_num =int(input("Enter your mobile number  "))
        
        if len(str(ph_num))!= 10:
            print("Enter the 10 digit phone number")
            continue
        else:
            result = cursor.execute("select * from student3")
            for detail in result:
                if detail[0] == ph_num:
                    print('Name = ', detail[1])
                    print('Enrolled Date = ',detail[2])
                    print('Mark = ',detail[3])
                    break
            else:
                print("Phone Number not found in database")
                break
#            continue
            break
    except:
        print("Phone number should be numeric")
        continue

Enter your mobile number  212131
Enter the 10 digit phone number
Enter your mobile number  cddg
Phone number should be numeric
Enter your mobile number  9988776604
Name =  Salah
Enrolled Date =  03-10-2020
Mark =  85